import {
  Calendar,
  ChevronRight,
  Download03,
  Loading01,
  Loading03,
  PlaySquare,
  QrCode02,
  Star06,
  X,
} from "@untitledui/icons";
import { AvatarLabelGroup } from "@/components/base/avatar/avatar-label-group";
import { Tabs } from "@/components/application/tabs/tabs";
import { useEffect, useMemo, useState } from "react";
import { Key } from "react-aria-components";
import EventCard from "@/components/event-card";
import WebApp from "@twa-dev/sdk";
import { ButtonUtility } from "@/components/base/buttons/button-utility";
import { useNavigate, useSearchParams } from "react-router";
import { AnimatePresence, motion } from "motion/react";
import AnimatingContainer from "@/components/animating-container";
import { User, useUserData } from "@/queries/user";
import { Button } from "@/components/base/buttons/button";
import { VideoPlayer } from "@/components/base/video-player/video-player";
import { handleIntroductionVideo } from "@/queries/avatar";
import { useQuery } from "@tanstack/react-query";
import { formatFullname } from "@/utils/format-fullname";
import { ScheduleDay, getSessionStatus, useSchedules } from "@/queries/schedules";
import formatTime from "@/utils/format-time";
import { useClientDetail } from "@/queries/clients";

const tabs = [
  { id: "20-11-2025", label: "20 нояб" },
  { id: "21-11-2025", label: "21 нояб" },
  { id: "22-11-2025", label: "22 нояб" },
];
const third_day = [
    {
        "id": 26,
        "schedule": 3,
        "title": "Экскурсия в Qasr AI Watan и TeamLab Phenomena",
        "description": "",
        "has_question": false,
        "has_materials": false,
        location: "Отель “Sofitel”",
        more_info: true,
        more_info_link: '/travel-1',
        "start_time": "10:00:00",
        "end_time": "13:30:00",
    },
    {
        "id": 27,
        "schedule": 3,
        "title": "Свободное время",
        "description": "",
        "has_question": false,
        "has_materials": false,
        "start_time": "13:30:00",
        "end_time": "17:30:00",
    },
    {
        "id": 28,
        "schedule": 3,
        "title": "Трансфер из отеля Sofitel Abu Dhabi Corniche в Emirates Palace",
        "description": "",
        "has_question": false,
        "has_materials": false,
        "start_time": "17:30:00",
        "end_time": "18:00:00",
    },
    {
        "id": 29,
        "schedule": 3,
        "title": "Гала ужин",
        "description": "",
        "has_question": false,
        "has_materials": false,
        location: "Emirates Palace Mandarin Oriental",
        more_info: true,
        more_info_link: '/travel-2',
        "start_time": "18:00:00",
        "end_time": "23:00:00",
    },
    {
        "id": 30,
        "schedule": 3,
        "title": "Трансфер в Sofitel Abu Dhabi Corniche",
        "description": "",
        "has_question": false,
        "has_materials": false,
        "start_time": "23:00:00",
        "end_time": "23:30:00"
    }
]

const timeStringToSeconds = (time: string) => {
  const [hours = "0", minutes = "0", seconds = "0"] = time.split(":");
  return Number(hours) * 3600 + Number(minutes) * 60 + Number(seconds);
};

export const HomeScreen = () => {
  const [searchParams, setSearchParams] = useSearchParams();
  const [selectedTabIndex, setSelectedTabIndex] = useState<Key>(() => {
    const tabFromUrl = searchParams.get('tab');
    return tabFromUrl && tabs.some(tab => tab.id === tabFromUrl) ? tabFromUrl : "20-11-2025";
  });
  const { data: userData } = useUserData();
  const { data: scheduleDays, isLoading } = useSchedules();
  const sortedScheduleDays = useMemo<ScheduleDay[]>(() => {
    if (!scheduleDays) {
      return [];
    }
    return scheduleDays.map((day) => ({
      ...day,
      sessions: [...day.sessions].sort(
        (a, b) =>
          timeStringToSeconds(a.start_time) - timeStringToSeconds(b.start_time)
      ),
    }));
  }, [scheduleDays]);

  console.log(sortedScheduleDays);
  const firstDay = sortedScheduleDays[0];
  const secondDay = sortedScheduleDays[1];
  const thirdDay = sortedScheduleDays[2];
  console.log(thirdDay);
  const navigate = useNavigate();
  
  useEffect(() => {
    const tabFromUrl = searchParams.get('tab');
    if (tabFromUrl && tabs.some(tab => tab.id === tabFromUrl) && tabFromUrl !== selectedTabIndex) {
      setSelectedTabIndex(tabFromUrl);
    }
  }, [searchParams]);
  
  useEffect(() => {
    const currentTab = searchParams.get('tab');
    if (currentTab !== selectedTabIndex) {
      setSearchParams({ tab: selectedTabIndex as string }, { replace: true });
    }
  }, [selectedTabIndex, searchParams, setSearchParams]);
  return (
    <>
      {/* head */}
      <div className="">
        {/* user */}
        <div className="flex justify-between items-start px-4 gap-2">
          <div onClick={() => navigate('/profile')}  className="bg-bg-tertiary grow py-3 px-4 rounded-[16px] active:opacity-80 transition-opacity">
            <div className="flex items-center gap-1 text-[12px] leading-[18px] font-medium text-text-tertiary mb-[6px]">
              <div>
                Личный кабинет
              </div>
              <ChevronRight size={16} className="text-fg-tertiary"/>
            </div>
            <UserAvatar userData={userData} />
          </div>
          <div onClick={() => {
                WebApp.HapticFeedback.impactOccurred("medium");
                navigate("/ticket");
              }} className="bg-bg-tertiary py-3 px-4 rounded-[16px] active:opacity-80 transition-opacity self-stretch flex flex-col justify-center items-center">
            <ButtonUtility
              onClick={() => {
                WebApp.HapticFeedback.impactOccurred("medium");
                navigate("/ticket");
              }} 
              color="tertiary"
              icon={<QrCode02 />}
            />
            <div onClick={() => {
                WebApp.HapticFeedback.impactOccurred("medium");
                navigate("/ticket");
              }} className="text-[12px] leading-[18px] font-medium text-text-tertiary">QR</div>
          </div>
        </div>
        <div className="flex overflow-x-auto items-center px-4">
          <div className="shrink-0 w-[328px] pr-4">
            <div
              onClick={() => {
                WebApp.HapticFeedback.impactOccurred("medium");
                navigate('/club-landing')
              }}
              className="active:scale-[.98] active:opacity-80 transition-all rounded-[16px]"
            >
              <img
                className="w-full"
                src="/banner.png"
                alt=""
              />
            </div>
          </div>
          {userData && (
            <IntroVideoBlock
              name={userData.fullname.split(" ")[0] || userData.fullname}
            />
          )}
          <div
            onClick={() => {
              WebApp.HapticFeedback.impactOccurred("medium");
              WebApp.openTelegramLink("https://t.me/+Q813prb4TPU5NGFi");
            }}
            className="p-4 active:scale-[.98] active:opacity-90 transition-all"
          >
            <EventChatCard />
          </div>
          
          <div className="shrink-0 w-[328px] py-4">
            <div className="bg-bg-tertiary p-4 border h-full border-alpha-black/10 rounded-[16px] flex flex-col justify-center items-center gap-3">
              <div className="font-medium text-[14px] leading-[20px]">
                Есть вопросы?
              </div>
              <Button
                onClick={() => {
                  WebApp.HapticFeedback.impactOccurred("medium");
                  WebApp.openTelegramLink("https://t.me/margulansupport");
                }}
                className="w-full"
                size="lg"
              >
                Написать в поддержку
              </Button>
            </div>
          </div>
        </div>
        <CalendarBlock
          selectedTabIndex={selectedTabIndex}
          setSelectedTabIndex={setSelectedTabIndex}
        />
      </div>
      {isLoading && <AnimatingContainer className="bg-white dark:bg-black flex-1 overflow-auto p-4 flex flex-col items-center justify-center gap-4">
        <div>Загрузка...</div>
      </AnimatingContainer> }
      {
        !isLoading && <>
        <AnimatePresence>
          {selectedTabIndex === "20-11-2025" && (
            <AnimatingContainer className="bg-white dark:bg-black flex-1 overflow-auto p-4 flex flex-col gap-4">
              {firstDay && firstDay.sessions.map(session => {
                return (
                  <EventCard
                    key={session.id}
                    event_id={session.id}
                    has_materials={session.has_materials}
                    has_questions={session.has_question}
                    attachments={session.attachments}
                    type={getSessionStatus(session.start_time, session.end_time, firstDay.date)}
                    text={session.title}
                    time={`${formatTime(session.start_time)} - ${formatTime(session.end_time)}`}
                  />
                )
              })}
            </AnimatingContainer>
          )}
        </AnimatePresence>
        <AnimatePresence>
          {selectedTabIndex === "21-11-2025" && (
            <AnimatingContainer className="bg-white dark:bg-black flex-1 overflow-auto p-4 flex flex-col gap-4">
              {secondDay && secondDay.sessions.map(session => {
                return (
                  <EventCard
                    key={session.id}
                    type={getSessionStatus(session.start_time, session.end_time, secondDay.date)}
                    text={session.title}
                    attachments={session.attachments}
                    has_materials={session.has_materials}
                    has_questions={session.has_question}
                    event_id={session.id}
                    time={`${formatTime(session.start_time)} - ${formatTime(session.end_time)}`}
                  />
                )
              })}
            </AnimatingContainer>
          )}
        </AnimatePresence>
        <AnimatePresence>
          {selectedTabIndex === "22-11-2025" && (
            <AnimatingContainer className="bg-white dark:bg-black flex-1 overflow-auto p-4 flex flex-col gap-4">
                {third_day.map(session => {
                  return (
                    <EventCard
                      key={session.id}
                      location={session.location}
                      moreInfo={session.more_info}
                      moreInfoLink={session.more_info_link}
                      type={getSessionStatus(session.start_time, session.end_time, thirdDay.date)}
                      text={session.title}
                      attachments={[]}
                      has_materials={session.has_materials}
                      has_questions={session.has_question}
                      event_id={session.id}
                      time={`${formatTime(session.start_time)} - ${formatTime(session.end_time)}`}
                    />
                  )
              })}
            </AnimatingContainer>
          )}
        </AnimatePresence></>
      }
    </>
  );
};

function IntroVideoBlock({ name }: { name: string }) {
  // const videoShown = localStorage.getItem('video_shown') === 'true'
  const { data, isLoading } = useQuery({
    queryKey: ["intro_video"],
    queryFn: () => {
      return handleIntroductionVideo(name);
    },
  });
  const [showVideoModal, setShowVideoModal] = useState(false);

  if (isLoading) {
    return (
      <div className="py-4 relative w-[328px] shrink-0 max-w-[]">
        <Star06 className="absolute top-5 left-10 rotate-12" size={16} />
        <Star06 className="absolute top-1 right-8 -rotate-12" size={28} />
        <div className="rounded-[16px] bg-gradient-to-tr p-4 from-[rgba(244,144,98,1)] to-[rgba(253,55,31,1)]">
          <div className="text-center text-[14px] leading-[20px] font-medium">
            Ваше персональное приветствие
          </div>
          <Button
            color="secondary"
            size="lg"
            className="w-full mt-3"
            iconLeading={
              <Loading01
                size={20}
                className="text-fg-quaternary animate-spin"
              />
            }
          >
            Ваше видео готовится...
          </Button>
        </div>
      </div>
    );
  }

  if (!data) return null;

  return (
    <>
      <AnimatePresence>
        {showVideoModal && (
          <VideoModal
            url={data.video_url}
            thumbnail={data.thumbnail_url}
            onClose={() => {
              setShowVideoModal(false);
              localStorage.setItem("video_shown", "true");
            }}
          />
        )}
      </AnimatePresence>
      <div className="py-4 relative w-[328px] shrink-0">
        <Star06 className="absolute top-5 left-10 rotate-12" size={16} />
        <Star06 className="absolute top-1 right-8 -rotate-12" size={28} />
        <div className="rounded-[16px] h-full flex flex-col items-center justify-center bg-gradient-to-tr p-4 from-[rgba(244,144,98,1)] to-[rgba(253,55,31,1)]">
          <div className="text-center text-[14px] leading-[20px] font-medium">
            Ваше персональное приветствие
          </div>
          <Button
            onClick={() => {
              setShowVideoModal(true);
            }}
            color="secondary"
            size="lg"
            className="w-full mt-3"
            iconLeading={
              <PlaySquare size={20} className="text-fg-quaternary" />
            }
          >
            Посмотреть
          </Button>
        </div>
      </div>
    </>
  );
}

function CalendarBlock({
  selectedTabIndex,
  setSelectedTabIndex,
}: {
  selectedTabIndex: Key;
  setSelectedTabIndex: (key: Key) => void;
}) {
  return (
    <div>
      <div className="pb-3 px-4 text-primary flex items-center gap-3">
        <Calendar size={24} />
        <div className="text-[24px] leading-[32px] font-semibold">
          Расписание
        </div>
      </div>
      <Tabs
        selectedKey={selectedTabIndex}
        onSelectionChange={(key) => {
          WebApp.HapticFeedback.impactOccurred("medium");
          setSelectedTabIndex(key);
        }}
        className="w-full"
      >
        <Tabs.List type="underline" fullWidth items={tabs}>
          {(tab) => <Tabs.Item {...tab} />}
        </Tabs.List>
      </Tabs>
    </div>
  );
}

function VideoModal({
  onClose,
  url,
  thumbnail,
}: {
  onClose: () => void;
  url: string;
  thumbnail: string;
}) {
  const [isDownloading, setIsDownloading] = useState(false);

  const downloadVideo = async () => {
    if (isDownloading) {
      return;
    }
    setIsDownloading(true);

    try {
      // Скачиваем файл
      const response = await fetch(url);
      const blob = await response.blob();

      // Создаем файл с правильным именем и типом
      const file = new File([blob], "personal-video.mp4", {
        type: "video/mp4",
      });

      // Проверяем поддержку Share API
      if (
        navigator.share &&
        navigator.canShare &&
        navigator.canShare({ files: [file] })
      ) {
        await navigator.share({
          files: [file],
          title: "Мое персональное видео",
          text: "Посмотрите мое персональное видео!",
        });
      } else {
        // Fallback: показываем сообщение об ошибке или используем альтернативный метод
        WebApp.showAlert(
          "Ваш браузер не поддерживает функцию Share API. Используйте длительное нажатие на видео для сохранения."
        );
      }
    } catch (error) {
      console.error("Ошибка при share видео:", error);
      WebApp.showAlert("Не удалось share видео. Попробуйте еще раз.");
    } finally {
      setIsDownloading(false);
    }
  };

  return (
    <motion.div
      className="fixed top-0 left-0 w-full h-full bg-bg-primary/70 flex flex-1 flex-col justify-center items-center z-[10000] p-4 "
      initial={{ opacity: 0, y: 20 }}
      animate={{ opacity: 1, y: 0 }}
      exit={{ opacity: 0, y: 20 }}
      transition={{ duration: 0.3 }}
      onClick={onClose}
    >
      <div
        onClick={(e) => e.stopPropagation()}
        className="relative aspect-[9/16]"
      >
        <ButtonUtility
          color="tertiary"
          className="absolute z-[10001] top-3 right-3"
          icon={<X className="text-white" size={24} />}
          onClick={() => {
            WebApp.HapticFeedback.impactOccurred("medium");
            onClose();
          }}
        ></ButtonUtility>
        <VideoPlayer
          loop={false}
          className="rounded-[12px] overflow-hidden"
          src={url}
          thumbnailUrl={thumbnail}
        />
        <ButtonUtility
          className="absolute z-[10001] left-3 top-3"
          color="tertiary"
          icon={
            isDownloading ? (
              <Loading03 className="text-text-primary animate-spin" />
            ) : (
              <Download03 className="text-text-primary" />
            )
          }
          onClick={downloadVideo}
          disabled={isDownloading}
        />
      </div>
    </motion.div>
  );
}

export const EventChatCard = () => {
  return (
    <svg
      className="w-[328px]"
      viewBox="0 0 328 108"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <path
        d="M0 16C0 7.16344 7.16344 0 16 0H312C320.837 0 328 7.16344 328 16V92C328 100.837 320.837 108 312 108H16C7.16345 108 0 100.837 0 92V16Z"
        fill="url(#paint0_linear_993_10677)"
      />
      <path
        d="M16 0.5H312C320.56 0.5 327.5 7.43959 327.5 16V92C327.5 100.56 320.56 107.5 312 107.5H16C7.43959 107.5 0.5 100.56 0.5 92V16C0.5 7.43959 7.43959 0.5 16 0.5Z"
        stroke="black"
        strokeOpacity="0.2"
      />
      <path
        d="M17.1477 34V22.3636H24.6307V24.1307H19.2557V26.858H21.5C22.3902 26.858 23.1534 27.0038 23.7898 27.2955C24.4299 27.5833 24.9205 27.9905 25.2614 28.517C25.6023 29.0436 25.7727 29.6629 25.7727 30.375C25.7727 31.0909 25.6023 31.7216 25.2614 32.267C24.9205 32.8087 24.4299 33.233 23.7898 33.5398C23.1534 33.8466 22.3902 34 21.5 34H17.1477ZM19.2557 32.2727H21.5C21.9697 32.2727 22.3674 32.1837 22.6932 32.0057C23.0189 31.8277 23.2652 31.5928 23.4318 31.3011C23.6023 31.0095 23.6875 30.6932 23.6875 30.3523C23.6875 29.8598 23.4981 29.4413 23.1193 29.0966C22.7443 28.7481 22.2045 28.5739 21.5 28.5739H19.2557V32.2727ZM28.804 37.2727C28.5237 37.2727 28.2642 37.25 28.0256 37.2045C27.7907 37.1629 27.6032 37.1136 27.4631 37.0568L27.9403 35.4545C28.2396 35.5417 28.5066 35.5833 28.7415 35.5795C28.9763 35.5758 29.1828 35.5019 29.3608 35.358C29.5426 35.2178 29.696 34.983 29.821 34.6534L29.9972 34.1818L26.8324 25.2727H29.0142L31.0256 31.8636H31.1165L33.1335 25.2727H35.321L31.8267 35.0568C31.6638 35.5189 31.4479 35.9148 31.179 36.2443C30.91 36.5777 30.5805 36.8314 30.1903 37.0057C29.804 37.1837 29.3419 37.2727 28.804 37.2727ZM35.2528 36.5341V32.3068H35.946C36.1316 32.1629 36.2869 31.9678 36.4119 31.7216C36.5369 31.4716 36.6392 31.178 36.7188 30.8409C36.8021 30.5 36.8703 30.1193 36.9233 29.6989C36.9763 29.2746 37.0237 28.8182 37.0653 28.3295L37.3153 25.2727H43.6222V32.3068H44.9744V36.5341H42.9858V34H37.2756V36.5341H35.2528ZM38.0597 32.3068H41.6562V26.9318H39.0994L38.9631 28.3295C38.8873 29.2538 38.7869 30.0455 38.6619 30.7045C38.5369 31.3636 38.3362 31.8977 38.0597 32.3068ZM47.902 28.1136H50.4759C51.5895 28.1136 52.4512 28.3845 53.0611 28.9261C53.6709 29.4678 53.9777 30.178 53.9815 31.0568C53.9777 31.6288 53.8376 32.1364 53.5611 32.5795C53.2884 33.0227 52.8906 33.3712 52.3679 33.625C51.849 33.875 51.2183 34 50.4759 34H46.5099V25.2727H48.4929V32.3125H50.4759C50.9228 32.3125 51.2902 32.1989 51.5781 31.9716C51.866 31.7405 52.0099 31.4451 52.0099 31.0852C52.0099 30.7064 51.866 30.3977 51.5781 30.1591C51.2902 29.9205 50.9228 29.8011 50.4759 29.8011H47.902V28.1136ZM54.3608 26.9602V25.2727H61.9972V26.9602H59.1733V34H57.1847V26.9602H54.3608ZM67.1392 34.1705C66.2642 34.1705 65.5085 33.9886 64.8722 33.625C64.2396 33.2576 63.7528 32.7386 63.4119 32.0682C63.071 31.3939 62.9006 30.6004 62.9006 29.6875C62.9006 28.7898 63.071 28.0019 63.4119 27.3239C63.7566 26.642 64.2377 26.1117 64.8551 25.733C65.4725 25.3504 66.1979 25.1591 67.0312 25.1591C67.5691 25.1591 68.0767 25.2462 68.554 25.4205C69.035 25.5909 69.4593 25.8561 69.8267 26.2159C70.1979 26.5758 70.4896 27.0341 70.7017 27.5909C70.9138 28.1439 71.0199 28.803 71.0199 29.5682V30.1989H63.8665V28.8125H69.0483C69.0445 28.4186 68.9593 28.0682 68.7926 27.7614C68.6259 27.4508 68.393 27.2064 68.0938 27.0284C67.7983 26.8504 67.4536 26.7614 67.0597 26.7614C66.6392 26.7614 66.2699 26.8636 65.9517 27.0682C65.6335 27.2689 65.3854 27.5341 65.2074 27.8636C65.0331 28.1894 64.9441 28.5473 64.9403 28.9375V30.1477C64.9403 30.6553 65.0331 31.0909 65.2188 31.4545C65.4044 31.8144 65.6638 32.0909 65.9972 32.2841C66.3305 32.4735 66.7206 32.5682 67.1676 32.5682C67.4669 32.5682 67.7377 32.5265 67.9801 32.4432C68.2225 32.3561 68.4328 32.2292 68.6108 32.0625C68.7888 31.8958 68.9233 31.6894 69.0142 31.4432L70.9347 31.6591C70.8134 32.1667 70.5824 32.6098 70.2415 32.9886C69.9044 33.3636 69.4725 33.6553 68.946 33.8636C68.4195 34.0682 67.8172 34.1705 67.1392 34.1705ZM76.7287 34V25.2727H80.3935C81.4276 25.2727 82.2438 25.4792 82.8423 25.892C83.4446 26.3049 83.7457 26.8807 83.7457 27.6193C83.7457 28.108 83.5753 28.5076 83.2344 28.8182C82.8973 29.125 82.437 29.3314 81.8537 29.4375C82.312 29.4754 82.7135 29.5909 83.0582 29.7841C83.4067 29.9773 83.6795 30.2311 83.8764 30.5455C84.0734 30.8598 84.1719 31.2216 84.1719 31.6307C84.1719 32.1117 84.045 32.5303 83.7912 32.8864C83.5412 33.2386 83.1757 33.5133 82.6946 33.7102C82.2173 33.9034 81.6378 34 80.956 34H76.7287ZM78.6548 32.3807H80.956C81.3348 32.3807 81.6321 32.2917 81.848 32.1136C82.0639 31.9318 82.1719 31.6856 82.1719 31.375C82.1719 31.0152 82.0639 30.733 81.848 30.5284C81.6321 30.3201 81.3348 30.2159 80.956 30.2159H78.6548V32.3807ZM78.6548 28.8864H80.4332C80.7135 28.8864 80.9541 28.8466 81.1548 28.767C81.3556 28.6837 81.509 28.5682 81.6151 28.4205C81.7211 28.2689 81.7741 28.089 81.7741 27.8807C81.7741 27.5814 81.651 27.3466 81.4048 27.1761C81.1624 27.0057 80.8253 26.9205 80.3935 26.9205H78.6548V28.8864ZM89.8381 34V25.2727H91.8949V28.7955H92.6449L95.2699 25.2727H97.7472L94.5142 29.5568L97.7812 34H95.2926L92.9006 30.7102H91.8949V34H89.8381ZM100.32 37.2727C100.039 37.2727 99.7798 37.25 99.5412 37.2045C99.3063 37.1629 99.1188 37.1136 98.9787 37.0568L99.456 35.4545C99.7552 35.5417 100.022 35.5833 100.257 35.5795C100.492 35.5758 100.698 35.5019 100.876 35.358C101.058 35.2178 101.212 34.983 101.337 34.6534L101.513 34.1818L98.348 25.2727H100.53L102.541 31.8636H102.632L104.649 25.2727H106.837L103.342 35.0568C103.179 35.5189 102.964 35.9148 102.695 36.2443C102.426 36.5777 102.096 36.8314 101.706 37.0057C101.32 37.1837 100.857 37.2727 100.32 37.2727ZM108.26 37.2727V25.2727H110.283V26.7159H110.402C110.508 26.5038 110.658 26.2784 110.851 26.0398C111.044 25.7973 111.305 25.5909 111.635 25.4205C111.964 25.2462 112.385 25.1591 112.896 25.1591C113.571 25.1591 114.179 25.3314 114.72 25.6761C115.266 26.017 115.697 26.5227 116.016 27.1932C116.338 27.8598 116.499 28.678 116.499 29.6477C116.499 30.6061 116.341 31.4205 116.027 32.0909C115.713 32.7614 115.285 33.2727 114.743 33.625C114.201 33.9773 113.588 34.1534 112.902 34.1534C112.402 34.1534 111.987 34.0701 111.658 33.9034C111.328 33.7367 111.063 33.536 110.862 33.3011C110.665 33.0625 110.512 32.8371 110.402 32.625H110.317V37.2727H108.26ZM110.277 29.6364C110.277 30.2008 110.357 30.6951 110.516 31.1193C110.679 31.5436 110.911 31.875 111.214 32.1136C111.521 32.3485 111.893 32.4659 112.328 32.4659C112.783 32.4659 113.163 32.3447 113.47 32.1023C113.777 31.8561 114.008 31.5208 114.163 31.0966C114.322 30.6686 114.402 30.1818 114.402 29.6364C114.402 29.0947 114.324 28.6136 114.169 28.1932C114.014 27.7727 113.783 27.4432 113.476 27.2045C113.169 26.9659 112.786 26.8466 112.328 26.8466C111.889 26.8466 111.516 26.9621 111.209 27.1932C110.902 27.4242 110.669 27.7481 110.51 28.1648C110.355 28.5814 110.277 29.072 110.277 29.6364ZM122.067 34.1705C121.196 34.1705 120.447 33.9792 119.822 33.5966C119.201 33.214 118.722 32.6856 118.385 32.0114C118.052 31.3333 117.885 30.553 117.885 29.6705C117.885 28.7841 118.055 28.0019 118.396 27.3239C118.737 26.642 119.218 26.1117 119.839 25.733C120.464 25.3504 121.203 25.1591 122.055 25.1591C122.764 25.1591 123.391 25.2898 123.936 25.5511C124.485 25.8087 124.923 26.1742 125.249 26.6477C125.574 27.1174 125.76 27.6667 125.805 28.2955H123.839C123.76 27.875 123.571 27.5246 123.271 27.2443C122.976 26.9602 122.58 26.8182 122.084 26.8182C121.663 26.8182 121.294 26.9318 120.976 27.1591C120.658 27.3826 120.41 27.7045 120.232 28.125C120.057 28.5455 119.97 29.0492 119.97 29.6364C119.97 30.2311 120.057 30.7424 120.232 31.1705C120.406 31.5947 120.65 31.9223 120.964 32.1534C121.283 32.3807 121.656 32.4943 122.084 32.4943C122.387 32.4943 122.658 32.4375 122.896 32.3239C123.139 32.2064 123.341 32.0379 123.504 31.8182C123.667 31.5985 123.779 31.3314 123.839 31.017H125.805C125.756 31.6345 125.574 32.1818 125.26 32.6591C124.946 33.1326 124.518 33.5038 123.976 33.7727C123.434 34.0379 122.798 34.1705 122.067 34.1705ZM131.358 34.1705C130.483 34.1705 129.727 33.9886 129.091 33.625C128.458 33.2576 127.972 32.7386 127.631 32.0682C127.29 31.3939 127.119 30.6004 127.119 29.6875C127.119 28.7898 127.29 28.0019 127.631 27.3239C127.975 26.642 128.456 26.1117 129.074 25.733C129.691 25.3504 130.417 25.1591 131.25 25.1591C131.788 25.1591 132.295 25.2462 132.773 25.4205C133.254 25.5909 133.678 25.8561 134.045 26.2159C134.417 26.5758 134.708 27.0341 134.92 27.5909C135.133 28.1439 135.239 28.803 135.239 29.5682V30.1989H128.085V28.8125H133.267C133.263 28.4186 133.178 28.0682 133.011 27.7614C132.845 27.4508 132.612 27.2064 132.312 27.0284C132.017 26.8504 131.672 26.7614 131.278 26.7614C130.858 26.7614 130.489 26.8636 130.17 27.0682C129.852 27.2689 129.604 27.5341 129.426 27.8636C129.252 28.1894 129.163 28.5473 129.159 28.9375V30.1477C129.159 30.6553 129.252 31.0909 129.438 31.4545C129.623 31.8144 129.883 32.0909 130.216 32.2841C130.549 32.4735 130.939 32.5682 131.386 32.5682C131.686 32.5682 131.956 32.5265 132.199 32.4432C132.441 32.3561 132.652 32.2292 132.83 32.0625C133.008 31.8958 133.142 31.6894 133.233 31.4432L135.153 31.6591C135.032 32.1667 134.801 32.6098 134.46 32.9886C134.123 33.3636 133.691 33.6553 133.165 33.8636C132.638 34.0682 132.036 34.1705 131.358 34.1705ZM146.942 28.7841V30.4716H142.294V28.7841H146.942ZM142.93 25.2727V34H140.947V25.2727H142.93ZM148.288 25.2727V34H146.311V25.2727H148.288ZM154.176 34.1705C153.324 34.1705 152.585 33.983 151.96 33.608C151.335 33.233 150.85 32.7083 150.506 32.0341C150.165 31.3598 149.994 30.572 149.994 29.6705C149.994 28.7689 150.165 27.9792 150.506 27.3011C150.85 26.6231 151.335 26.0966 151.96 25.7216C152.585 25.3466 153.324 25.1591 154.176 25.1591C155.028 25.1591 155.767 25.3466 156.392 25.7216C157.017 26.0966 157.5 26.6231 157.841 27.3011C158.186 27.9792 158.358 28.7689 158.358 29.6705C158.358 30.572 158.186 31.3598 157.841 32.0341C157.5 32.7083 157.017 33.233 156.392 33.608C155.767 33.983 155.028 34.1705 154.176 34.1705ZM154.188 32.5227C154.65 32.5227 155.036 32.3958 155.347 32.142C155.657 31.8845 155.888 31.5398 156.04 31.108C156.195 30.6761 156.273 30.1951 156.273 29.6648C156.273 29.1307 156.195 28.6477 156.04 28.2159C155.888 27.7803 155.657 27.4337 155.347 27.1761C155.036 26.9186 154.65 26.7898 154.188 26.7898C153.714 26.7898 153.32 26.9186 153.006 27.1761C152.695 27.4337 152.462 27.7803 152.307 28.2159C152.155 28.6477 152.08 29.1307 152.08 29.6648C152.08 30.1951 152.155 30.6761 152.307 31.108C152.462 31.5398 152.695 31.8845 153.006 32.142C153.32 32.3958 153.714 32.5227 154.188 32.5227ZM160.104 34V25.2727H163.768C164.803 25.2727 165.619 25.4792 166.217 25.892C166.82 26.3049 167.121 26.8807 167.121 27.6193C167.121 28.108 166.95 28.5076 166.609 28.8182C166.272 29.125 165.812 29.3314 165.229 29.4375C165.687 29.4754 166.089 29.5909 166.433 29.7841C166.782 29.9773 167.054 30.2311 167.251 30.5455C167.448 30.8598 167.547 31.2216 167.547 31.6307C167.547 32.1117 167.42 32.5303 167.166 32.8864C166.916 33.2386 166.551 33.5133 166.07 33.7102C165.592 33.9034 165.013 34 164.331 34H160.104ZM162.03 32.3807H164.331C164.71 32.3807 165.007 32.2917 165.223 32.1136C165.439 31.9318 165.547 31.6856 165.547 31.375C165.547 31.0152 165.439 30.733 165.223 30.5284C165.007 30.3201 164.71 30.2159 164.331 30.2159H162.03V32.3807ZM162.03 28.8864H163.808C164.089 28.8864 164.329 28.8466 164.53 28.767C164.731 28.6837 164.884 28.5682 164.99 28.4205C165.096 28.2689 165.149 28.089 165.149 27.8807C165.149 27.5814 165.026 27.3466 164.78 27.1761C164.537 27.0057 164.2 26.9205 163.768 26.9205H162.03V28.8864ZM173.051 34.1705C172.199 34.1705 171.46 33.983 170.835 33.608C170.21 33.233 169.725 32.7083 169.381 32.0341C169.04 31.3598 168.869 30.572 168.869 29.6705C168.869 28.7689 169.04 27.9792 169.381 27.3011C169.725 26.6231 170.21 26.0966 170.835 25.7216C171.46 25.3466 172.199 25.1591 173.051 25.1591C173.903 25.1591 174.642 25.3466 175.267 25.7216C175.892 26.0966 176.375 26.6231 176.716 27.3011C177.061 27.9792 177.233 28.7689 177.233 29.6705C177.233 30.572 177.061 31.3598 176.716 32.0341C176.375 32.7083 175.892 33.233 175.267 33.608C174.642 33.983 173.903 34.1705 173.051 34.1705ZM173.062 32.5227C173.525 32.5227 173.911 32.3958 174.222 32.142C174.532 31.8845 174.763 31.5398 174.915 31.108C175.07 30.6761 175.148 30.1951 175.148 29.6648C175.148 29.1307 175.07 28.6477 174.915 28.2159C174.763 27.7803 174.532 27.4337 174.222 27.1761C173.911 26.9186 173.525 26.7898 173.062 26.7898C172.589 26.7898 172.195 26.9186 171.881 27.1761C171.57 27.4337 171.337 27.7803 171.182 28.2159C171.03 28.6477 170.955 29.1307 170.955 29.6648C170.955 30.1951 171.03 30.6761 171.182 31.108C171.337 31.5398 171.57 31.8845 171.881 32.142C172.195 32.3958 172.589 32.5227 173.062 32.5227ZM182.786 34.1705C181.914 34.1705 181.166 33.9792 180.541 33.5966C179.92 33.214 179.441 32.6856 179.104 32.0114C178.77 31.3333 178.604 30.553 178.604 29.6705C178.604 28.7841 178.774 28.0019 179.115 27.3239C179.456 26.642 179.937 26.1117 180.558 25.733C181.183 25.3504 181.922 25.1591 182.774 25.1591C183.482 25.1591 184.109 25.2898 184.655 25.5511C185.204 25.8087 185.642 26.1742 185.967 26.6477C186.293 27.1174 186.479 27.6667 186.524 28.2955H184.558C184.479 27.875 184.289 27.5246 183.99 27.2443C183.695 26.9602 183.299 26.8182 182.803 26.8182C182.382 26.8182 182.013 26.9318 181.695 27.1591C181.376 27.3826 181.128 27.7045 180.95 28.125C180.776 28.5455 180.689 29.0492 180.689 29.6364C180.689 30.2311 180.776 30.7424 180.95 31.1705C181.125 31.5947 181.369 31.9223 181.683 32.1534C182.001 32.3807 182.375 32.4943 182.803 32.4943C183.106 32.4943 183.376 32.4375 183.615 32.3239C183.857 32.2064 184.06 32.0379 184.223 31.8182C184.386 31.5985 184.498 31.3314 184.558 31.017H186.524C186.475 31.6345 186.293 32.1818 185.979 32.6591C185.664 33.1326 185.236 33.5038 184.695 33.7727C184.153 34.0379 183.517 34.1705 182.786 34.1705ZM187.58 26.9602V25.2727H195.216V26.9602H192.392V34H190.403V26.9602H187.58ZM200.358 34.1705C199.483 34.1705 198.727 33.9886 198.091 33.625C197.458 33.2576 196.972 32.7386 196.631 32.0682C196.29 31.3939 196.119 30.6004 196.119 29.6875C196.119 28.7898 196.29 28.0019 196.631 27.3239C196.975 26.642 197.456 26.1117 198.074 25.733C198.691 25.3504 199.417 25.1591 200.25 25.1591C200.788 25.1591 201.295 25.2462 201.773 25.4205C202.254 25.5909 202.678 25.8561 203.045 26.2159C203.417 26.5758 203.708 27.0341 203.92 27.5909C204.133 28.1439 204.239 28.803 204.239 29.5682V30.1989H197.085V28.8125H202.267C202.263 28.4186 202.178 28.0682 202.011 27.7614C201.845 27.4508 201.612 27.2064 201.312 27.0284C201.017 26.8504 200.672 26.7614 200.278 26.7614C199.858 26.7614 199.489 26.8636 199.17 27.0682C198.852 27.2689 198.604 27.5341 198.426 27.8636C198.252 28.1894 198.163 28.5473 198.159 28.9375V30.1477C198.159 30.6553 198.252 31.0909 198.438 31.4545C198.623 31.8144 198.883 32.0909 199.216 32.2841C199.549 32.4735 199.939 32.5682 200.386 32.5682C200.686 32.5682 200.956 32.5265 201.199 32.4432C201.441 32.3561 201.652 32.2292 201.83 32.0625C202.008 31.8958 202.142 31.6894 202.233 31.4432L204.153 31.6591C204.032 32.1667 203.801 32.6098 203.46 32.9886C203.123 33.3636 202.691 33.6553 202.165 33.8636C201.638 34.0682 201.036 34.1705 200.358 34.1705ZM207.962 31.2159L211.456 25.2727H213.57V34H211.581V28.0511L208.098 34H205.979V25.2727H207.962V31.2159ZM210.893 22.2727H212.433C212.433 22.9356 212.193 23.4735 211.712 23.8864C211.234 24.2955 210.587 24.5 209.768 24.5C208.958 24.5 208.312 24.2955 207.831 23.8864C207.354 23.4735 207.117 22.9356 207.121 22.2727H208.649C208.649 22.5455 208.732 22.7898 208.899 23.0057C209.07 23.2178 209.359 23.3239 209.768 23.3239C210.17 23.3239 210.456 23.2178 210.626 23.0057C210.801 22.7936 210.89 22.5492 210.893 22.2727Z"
        fill="white"
      />
      <path
        d="M17.233 63V52.8182H20.7926C21.5019 52.8182 22.0869 52.9408 22.5476 53.1861C23.0083 53.428 23.3513 53.7545 23.5767 54.1655C23.8021 54.5732 23.9148 55.0256 23.9148 55.5227C23.9148 55.9602 23.8369 56.3215 23.6811 56.6065C23.5286 56.8916 23.3265 57.117 23.0746 57.2827C22.826 57.4484 22.5559 57.571 22.2642 57.6506V57.75C22.5758 57.7699 22.889 57.8793 23.2038 58.0781C23.5187 58.277 23.7822 58.562 23.9943 58.9332C24.2064 59.3045 24.3125 59.7585 24.3125 60.2955C24.3125 60.8059 24.1965 61.2649 23.9645 61.6726C23.7325 62.0803 23.3662 62.4034 22.8658 62.642C22.3653 62.8807 21.714 63 20.9119 63H17.233ZM18.4659 61.9062H20.9119C21.7173 61.9062 22.2891 61.7505 22.6271 61.4389C22.9685 61.1241 23.1392 60.7429 23.1392 60.2955C23.1392 59.9508 23.0514 59.6326 22.8757 59.3409C22.7 59.0459 22.4498 58.8106 22.125 58.6349C21.8002 58.456 21.4157 58.3665 20.9716 58.3665H18.4659V61.9062ZM18.4659 57.2926H20.7528C21.1241 57.2926 21.4588 57.2197 21.7571 57.0739C22.0587 56.928 22.2973 56.7225 22.473 56.4574C22.652 56.1922 22.7415 55.8807 22.7415 55.5227C22.7415 55.0753 22.5857 54.6958 22.2741 54.3842C21.9626 54.0694 21.4688 53.9119 20.7926 53.9119H18.4659V57.2926ZM29.2816 63.1591C28.5657 63.1591 27.9492 62.9901 27.4322 62.652C26.9151 62.3139 26.5174 61.8482 26.239 61.255C25.9606 60.6617 25.8214 59.9839 25.8214 59.2216C25.8214 58.446 25.9639 57.7616 26.2489 57.1683C26.5373 56.5717 26.9383 56.1061 27.4521 55.7713C27.9691 55.4332 28.5723 55.2642 29.2617 55.2642C29.7987 55.2642 30.2826 55.3636 30.7134 55.5625C31.1443 55.7614 31.4973 56.0398 31.7724 56.3977C32.0475 56.7557 32.2182 57.1733 32.2844 57.6506H31.1112C31.0217 57.3026 30.8228 56.9943 30.5146 56.7259C30.2096 56.4541 29.7987 56.3182 29.2816 56.3182C28.8242 56.3182 28.4232 56.4375 28.0785 56.6761C27.7371 56.9115 27.4703 57.2446 27.2781 57.6754C27.0891 58.103 26.9947 58.6051 26.9947 59.1818C26.9947 59.7718 27.0875 60.2855 27.2731 60.723C27.462 61.1605 27.7272 61.5002 28.0685 61.7422C28.4132 61.9841 28.8176 62.1051 29.2816 62.1051C29.5865 62.1051 29.8633 62.0521 30.1119 61.946C30.3604 61.84 30.5709 61.6875 30.7433 61.4886C30.9156 61.2898 31.0382 61.0511 31.1112 60.7727H32.2844C32.2182 61.2235 32.0541 61.6295 31.7923 61.9908C31.5337 62.3487 31.1907 62.6338 30.7631 62.8459C30.3389 63.0547 29.8451 63.1591 29.2816 63.1591ZM33.3981 56.4574V55.3636H39.6026V56.4574H37.0969V63H35.9237V56.4574H33.3981ZM42.0698 65.8636C41.8709 65.8636 41.6936 65.8471 41.5378 65.8139C41.382 65.7841 41.2743 65.7543 41.2147 65.7244L41.513 64.6903C41.798 64.7633 42.0499 64.7898 42.2686 64.7699C42.4874 64.75 42.6813 64.6522 42.8503 64.4766C43.0227 64.3042 43.1801 64.0241 43.3226 63.6364L43.5414 63.0398L40.7175 55.3636H41.9902L44.0982 61.4489H44.1777L46.2857 55.3636H47.5584L44.3169 64.1136C44.1711 64.508 43.9905 64.8345 43.775 65.093C43.5596 65.3549 43.3094 65.5488 43.0243 65.6747C42.7426 65.8007 42.4244 65.8636 42.0698 65.8636ZM49.1071 63V55.3636H55.1127V63H53.9395V56.4574H50.2804V63H49.1071ZM58.4288 61.2699L62.1078 55.3636H63.46V63H62.2868V57.0938L58.6277 63H57.2555V55.3636H58.4288V61.2699ZM64.57 56.4574V55.3636H70.7745V56.4574H68.2688V63H67.0955V56.4574H64.57ZM75.2912 63.1591C74.5554 63.1591 73.9207 62.9967 73.3871 62.6719C72.8568 62.3438 72.4474 61.8864 72.1591 61.2997C71.8741 60.7098 71.7315 60.0237 71.7315 59.2415C71.7315 58.4593 71.8741 57.7699 72.1591 57.1733C72.4474 56.5734 72.8485 56.1061 73.3622 55.7713C73.8793 55.4332 74.4825 55.2642 75.1719 55.2642C75.5696 55.2642 75.9624 55.3305 76.3501 55.4631C76.7379 55.5956 77.0909 55.8111 77.4091 56.1094C77.7273 56.4044 77.9808 56.7955 78.1697 57.2827C78.3587 57.7699 78.4531 58.3698 78.4531 59.0824V59.5795H72.5668V58.5653H77.2599C77.2599 58.1345 77.1738 57.75 77.0014 57.4119C76.8324 57.0739 76.5904 56.8071 76.2756 56.6115C75.964 56.416 75.5961 56.3182 75.1719 56.3182C74.7045 56.3182 74.3002 56.4342 73.9588 56.6662C73.6207 56.8949 73.3606 57.1932 73.1783 57.5611C72.996 57.929 72.9048 58.3234 72.9048 58.7443V59.4205C72.9048 59.9972 73.0043 60.486 73.2031 60.8871C73.4053 61.2848 73.6854 61.5881 74.0433 61.7969C74.4013 62.0024 74.8172 62.1051 75.2912 62.1051C75.5994 62.1051 75.8778 62.062 76.1264 61.9759C76.3783 61.8864 76.5954 61.7538 76.7777 61.5781C76.96 61.3991 77.1009 61.1771 77.2003 60.9119L78.3338 61.2301C78.2145 61.6146 78.014 61.9527 77.7322 62.2443C77.4505 62.5327 77.1025 62.758 76.6882 62.9205C76.2739 63.0795 75.8082 63.1591 75.2912 63.1591ZM84.1754 63V55.3636H87.2976C88.1196 55.3636 88.7725 55.5492 89.2564 55.9205C89.7403 56.2917 89.9822 56.7822 89.9822 57.392C89.9822 57.8561 89.8447 58.2157 89.5696 58.4709C89.2945 58.7228 88.9415 58.8935 88.5107 58.983C88.7924 59.0227 89.0658 59.1222 89.331 59.2812C89.5994 59.4403 89.8215 59.6591 89.9972 59.9375C90.1728 60.2126 90.2607 60.5507 90.2607 60.9517C90.2607 61.3428 90.1612 61.6925 89.9624 62.0007C89.7635 62.3089 89.4785 62.5526 89.1072 62.7315C88.736 62.9105 88.2919 63 87.7749 63H84.1754ZM85.2891 61.9261H87.7749C88.1792 61.9261 88.4957 61.83 88.7244 61.6378C88.9531 61.4455 89.0675 61.1837 89.0675 60.8523C89.0675 60.4579 88.9531 60.148 88.7244 59.9226C88.4957 59.6939 88.1792 59.5795 87.7749 59.5795H85.2891V61.9261ZM85.2891 58.5653H87.2976C87.6125 58.5653 87.8826 58.5223 88.108 58.4361C88.3333 58.3466 88.5057 58.2206 88.625 58.0582C88.7476 57.8925 88.8089 57.697 88.8089 57.4716C88.8089 57.1501 88.6747 56.8982 88.4062 56.7159C88.1378 56.5303 87.7682 56.4375 87.2976 56.4375H85.2891V58.5653ZM101.861 55.3636V63H100.687V55.3636H101.861ZM101.403 59.0028V60.0966C101.138 60.196 100.875 60.2839 100.613 60.3601C100.351 60.433 100.076 60.491 99.7875 60.5341C99.4991 60.5739 99.1826 60.5938 98.8379 60.5938C97.9728 60.5938 97.2785 60.3601 96.7548 59.8928C96.2344 59.4254 95.9743 58.7244 95.9743 57.7898V55.3438H97.1475V57.7898C97.1475 58.1809 97.2221 58.5024 97.3713 58.7543C97.5204 59.0062 97.7226 59.1934 97.9778 59.3161C98.233 59.4387 98.5197 59.5 98.8379 59.5C99.335 59.5 99.7842 59.4553 100.185 59.3658C100.59 59.273 100.996 59.152 101.403 59.0028ZM106.26 63.179C105.777 63.179 105.337 63.0878 104.943 62.9055C104.549 62.7199 104.235 62.4531 104.003 62.1051C103.771 61.7538 103.655 61.3295 103.655 60.8324C103.655 60.3949 103.742 60.0402 103.914 59.7685C104.086 59.4934 104.317 59.2779 104.605 59.1222C104.893 58.9664 105.211 58.8504 105.559 58.7741C105.911 58.6946 106.264 58.6316 106.618 58.5852C107.082 58.5256 107.459 58.4808 107.747 58.451C108.039 58.4179 108.251 58.3632 108.383 58.2869C108.519 58.2107 108.587 58.0781 108.587 57.8892V57.8494C108.587 57.3589 108.453 56.9777 108.184 56.706C107.919 56.4342 107.517 56.2983 106.976 56.2983C106.416 56.2983 105.977 56.4209 105.659 56.6662C105.341 56.9115 105.117 57.1733 104.988 57.4517L103.874 57.054C104.073 56.59 104.338 56.2287 104.67 55.9702C105.004 55.7083 105.369 55.526 105.763 55.4233C106.161 55.3172 106.552 55.2642 106.937 55.2642C107.182 55.2642 107.464 55.294 107.782 55.3537C108.103 55.41 108.413 55.5277 108.711 55.7067C109.013 55.8857 109.263 56.1558 109.462 56.517C109.661 56.8783 109.76 57.3622 109.76 57.9688V63H108.587V61.9659H108.528C108.448 62.1316 108.315 62.3089 108.13 62.4979C107.944 62.6868 107.697 62.8475 107.389 62.9801C107.081 63.1127 106.705 63.179 106.26 63.179ZM106.439 62.125C106.903 62.125 107.295 62.0339 107.613 61.8516C107.934 61.6693 108.176 61.4339 108.339 61.1456C108.504 60.8572 108.587 60.554 108.587 60.2358V59.1619C108.537 59.2216 108.428 59.2763 108.259 59.326C108.093 59.3724 107.901 59.4138 107.682 59.4503C107.467 59.4834 107.256 59.5133 107.051 59.5398C106.849 59.563 106.685 59.5829 106.559 59.5994C106.254 59.6392 105.969 59.7038 105.704 59.7933C105.442 59.8795 105.23 60.0104 105.067 60.1861C104.908 60.3584 104.829 60.5937 104.829 60.892C104.829 61.2997 104.979 61.608 105.281 61.8168C105.586 62.0223 105.972 62.125 106.439 62.125ZM110.863 56.4574V55.3636H117.067V56.4574H114.562V63H113.388V56.4574H110.863ZM125.819 63.1591C125.103 63.1591 124.486 62.9901 123.969 62.652C123.452 62.3139 123.055 61.8482 122.776 61.255C122.498 60.6617 122.358 59.9839 122.358 59.2216C122.358 58.446 122.501 57.7616 122.786 57.1683C123.074 56.5717 123.475 56.1061 123.989 55.7713C124.506 55.4332 125.109 55.2642 125.799 55.2642C126.336 55.2642 126.82 55.3636 127.251 55.5625C127.681 55.7614 128.034 56.0398 128.309 56.3977C128.585 56.7557 128.755 57.1733 128.822 57.6506H127.648C127.559 57.3026 127.36 56.9943 127.052 56.7259C126.747 56.4541 126.336 56.3182 125.819 56.3182C125.361 56.3182 124.96 56.4375 124.616 56.6761C124.274 56.9115 124.007 57.2446 123.815 57.6754C123.626 58.103 123.532 58.6051 123.532 59.1818C123.532 59.7718 123.625 60.2855 123.81 60.723C123.999 61.1605 124.264 61.5002 124.606 61.7422C124.95 61.9841 125.355 62.1051 125.819 62.1051C126.124 62.1051 126.4 62.0521 126.649 61.946C126.898 61.84 127.108 61.6875 127.28 61.4886C127.453 61.2898 127.575 61.0511 127.648 60.7727H128.822C128.755 61.2235 128.591 61.6295 128.329 61.9908C128.071 62.3487 127.728 62.6338 127.3 62.8459C126.876 63.0547 126.382 63.1591 125.819 63.1591ZM129.861 63V61.9062H130.139C130.368 61.9062 130.558 61.8615 130.711 61.772C130.863 61.6792 130.986 61.5185 131.079 61.2898C131.175 61.0578 131.248 60.7363 131.297 60.3253C131.35 59.911 131.389 59.384 131.412 58.7443L131.551 55.3636H136.642V63H135.469V56.4574H132.665L132.545 59.1818C132.519 59.8082 132.462 60.3601 132.376 60.8374C132.293 61.3113 132.166 61.709 131.993 62.0305C131.824 62.352 131.599 62.594 131.317 62.7564C131.036 62.9188 130.683 63 130.258 63H129.861ZM141.996 63.1591C141.26 63.1591 140.626 62.9967 140.092 62.6719C139.562 62.3438 139.153 61.8864 138.864 61.2997C138.579 60.7098 138.437 60.0237 138.437 59.2415C138.437 58.4593 138.579 57.7699 138.864 57.1733C139.153 56.5734 139.554 56.1061 140.067 55.7713C140.584 55.4332 141.188 55.2642 141.877 55.2642C142.275 55.2642 142.667 55.3305 143.055 55.4631C143.443 55.5956 143.796 55.8111 144.114 56.1094C144.432 56.4044 144.686 56.7955 144.875 57.2827C145.064 57.7699 145.158 58.3698 145.158 59.0824V59.5795H139.272V58.5653H143.965C143.965 58.1345 143.879 57.75 143.706 57.4119C143.537 57.0739 143.296 56.8071 142.981 56.6115C142.669 56.416 142.301 56.3182 141.877 56.3182C141.41 56.3182 141.005 56.4342 140.664 56.6662C140.326 56.8949 140.066 57.1932 139.883 57.5611C139.701 57.929 139.61 58.3234 139.61 58.7443V59.4205C139.61 59.9972 139.709 60.486 139.908 60.8871C140.11 61.2848 140.39 61.5881 140.748 61.7969C141.106 62.0024 141.522 62.1051 141.996 62.1051C142.305 62.1051 142.583 62.062 142.831 61.9759C143.083 61.8864 143.3 61.7538 143.483 61.5781C143.665 61.3991 143.806 61.1771 143.905 60.9119L145.039 61.2301C144.92 61.6146 144.719 61.9527 144.437 62.2443C144.156 62.5327 143.808 62.758 143.393 62.9205C142.979 63.0795 142.513 63.1591 141.996 63.1591ZM146.232 56.4574V55.3636H152.437V56.4574H149.931V63H148.758V56.4574H146.232ZM155.999 63.179C155.515 63.179 155.076 63.0878 154.681 62.9055C154.287 62.7199 153.974 62.4531 153.742 62.1051C153.51 61.7538 153.394 61.3295 153.394 60.8324C153.394 60.3949 153.48 60.0402 153.652 59.7685C153.825 59.4934 154.055 59.2779 154.343 59.1222C154.632 58.9664 154.95 58.8504 155.298 58.7741C155.649 58.6946 156.002 58.6316 156.357 58.5852C156.821 58.5256 157.197 58.4808 157.485 58.451C157.777 58.4179 157.989 58.3632 158.122 58.2869C158.258 58.2107 158.325 58.0781 158.325 57.8892V57.8494C158.325 57.3589 158.191 56.9777 157.923 56.706C157.658 56.4342 157.255 56.2983 156.715 56.2983C156.155 56.2983 155.715 56.4209 155.397 56.6662C155.079 56.9115 154.855 57.1733 154.726 57.4517L153.612 57.054C153.811 56.59 154.076 56.2287 154.408 55.9702C154.743 55.7083 155.107 55.526 155.502 55.4233C155.899 55.3172 156.29 55.2642 156.675 55.2642C156.92 55.2642 157.202 55.294 157.52 55.3537C157.842 55.41 158.151 55.5277 158.45 55.7067C158.751 55.8857 159.002 56.1558 159.2 56.517C159.399 56.8783 159.499 57.3622 159.499 57.9688V63H158.325V61.9659H158.266C158.186 62.1316 158.054 62.3089 157.868 62.4979C157.682 62.6868 157.436 62.8475 157.127 62.9801C156.819 63.1127 156.443 63.179 155.999 63.179ZM156.178 62.125C156.642 62.125 157.033 62.0339 157.351 61.8516C157.673 61.6693 157.914 61.4339 158.077 61.1456C158.243 60.8572 158.325 60.554 158.325 60.2358V59.1619C158.276 59.2216 158.166 59.2763 157.997 59.326C157.832 59.3724 157.639 59.4138 157.421 59.4503C157.205 59.4834 156.995 59.5133 156.789 59.5398C156.587 59.563 156.423 59.5829 156.297 59.5994C155.992 59.6392 155.707 59.7038 155.442 59.7933C155.18 59.8795 154.968 60.0104 154.806 60.1861C154.646 60.3584 154.567 60.5937 154.567 60.892C154.567 61.2997 154.718 61.608 155.019 61.8168C155.324 62.0223 155.71 62.125 156.178 62.125ZM17.0739 83V75.3636H20.196C21.018 75.3636 21.6709 75.5492 22.1548 75.9205C22.6387 76.2917 22.8807 76.7822 22.8807 77.392C22.8807 77.8561 22.7431 78.2157 22.468 78.4709C22.1929 78.7228 21.84 78.8935 21.4091 78.983C21.6908 79.0227 21.9643 79.1222 22.2294 79.2812C22.4979 79.4403 22.7199 79.6591 22.8956 79.9375C23.0713 80.2126 23.1591 80.5507 23.1591 80.9517C23.1591 81.3428 23.0597 81.6925 22.8608 82.0007C22.6619 82.3089 22.3769 82.5526 22.0057 82.7315C21.6345 82.9105 21.1903 83 20.6733 83H17.0739ZM18.1875 81.9261H20.6733C21.0777 81.9261 21.3942 81.83 21.6229 81.6378C21.8516 81.4455 21.9659 81.1837 21.9659 80.8523C21.9659 80.4579 21.8516 80.148 21.6229 79.9226C21.3942 79.6939 21.0777 79.5795 20.6733 79.5795H18.1875V81.9261ZM18.1875 78.5653H20.196C20.5109 78.5653 20.781 78.5223 21.0064 78.4361C21.2318 78.3466 21.4041 78.2206 21.5234 78.0582C21.6461 77.8925 21.7074 77.697 21.7074 77.4716C21.7074 77.1501 21.5732 76.8982 21.3047 76.7159C21.0362 76.5303 20.6667 76.4375 20.196 76.4375H18.1875V78.5653ZM28.475 73.9119V72.8182H36.1113V73.9119H32.9096V83H31.6767V73.9119H28.475ZM39.9494 83.1591C39.2136 83.1591 38.5789 82.9967 38.0453 82.6719C37.515 82.3438 37.1056 81.8864 36.8173 81.2997C36.5323 80.7098 36.3897 80.0237 36.3897 79.2415C36.3897 78.4593 36.5323 77.7699 36.8173 77.1733C37.1056 76.5734 37.5067 76.1061 38.0204 75.7713C38.5375 75.4332 39.1407 75.2642 39.8301 75.2642C40.2278 75.2642 40.6206 75.3305 41.0083 75.4631C41.3961 75.5956 41.7491 75.8111 42.0673 76.1094C42.3855 76.4044 42.639 76.7955 42.8279 77.2827C43.0169 77.7699 43.1113 78.3698 43.1113 79.0824V79.5795H37.225V78.5653H41.9181C41.9181 78.1345 41.832 77.75 41.6596 77.4119C41.4906 77.0739 41.2486 76.8071 40.9338 76.6115C40.6222 76.416 40.2543 76.3182 39.8301 76.3182C39.3627 76.3182 38.9584 76.4342 38.617 76.6662C38.2789 76.8949 38.0188 77.1932 37.8365 77.5611C37.6542 77.929 37.563 78.3234 37.563 78.7443V79.4205C37.563 79.9972 37.6625 80.486 37.8613 80.8871C38.0635 81.2848 38.3436 81.5881 38.7015 81.7969C39.0595 82.0024 39.4754 82.1051 39.9494 82.1051C40.2576 82.1051 40.536 82.062 40.7846 81.9759C41.0365 81.8864 41.2536 81.7538 41.4359 81.5781C41.6182 81.3991 41.7591 81.1771 41.8585 80.9119L42.992 81.2301C42.8727 81.6146 42.6722 81.9527 42.3904 82.2443C42.1087 82.5327 41.7607 82.758 41.3464 82.9205C40.9321 83.0795 40.4664 83.1591 39.9494 83.1591ZM46.0694 72.8182V83H44.8961V72.8182H46.0694ZM51.4201 83.1591C50.6843 83.1591 50.0496 82.9967 49.516 82.6719C48.9857 82.3438 48.5763 81.8864 48.288 81.2997C48.003 80.7098 47.8604 80.0237 47.8604 79.2415C47.8604 78.4593 48.003 77.7699 48.288 77.1733C48.5763 76.5734 48.9774 76.1061 49.4911 75.7713C50.0082 75.4332 50.6114 75.2642 51.3008 75.2642C51.6985 75.2642 52.0913 75.3305 52.479 75.4631C52.8668 75.5956 53.2198 75.8111 53.538 76.1094C53.8562 76.4044 54.1097 76.7955 54.2987 77.2827C54.4876 77.7699 54.582 78.3698 54.582 79.0824V79.5795H48.6957V78.5653H53.3888C53.3888 78.1345 53.3027 77.75 53.1303 77.4119C52.9613 77.0739 52.7193 76.8071 52.4045 76.6115C52.0929 76.416 51.725 76.3182 51.3008 76.3182C50.8335 76.3182 50.4291 76.4342 50.0877 76.6662C49.7496 76.8949 49.4895 77.1932 49.3072 77.5611C49.1249 77.929 49.0337 78.3234 49.0337 78.7443V79.4205C49.0337 79.9972 49.1332 80.486 49.332 80.8871C49.5342 81.2848 49.8143 81.5881 50.1722 81.7969C50.5302 82.0024 50.9461 82.1051 51.4201 82.1051C51.7283 82.1051 52.0067 82.062 52.2553 81.9759C52.5072 81.8864 52.7243 81.7538 52.9066 81.5781C53.0889 81.3991 53.2298 81.1771 53.3292 80.9119L54.4627 81.2301C54.3434 81.6146 54.1429 81.9527 53.8612 82.2443C53.5794 82.5327 53.2314 82.758 52.8171 82.9205C52.4028 83.0795 51.9371 83.1591 51.4201 83.1591ZM59.4492 86.0227C58.8825 86.0227 58.3952 85.9498 57.9876 85.804C57.5799 85.6615 57.2402 85.4725 56.9684 85.2372C56.6999 85.0052 56.4862 84.7566 56.3271 84.4915L57.2617 83.8352C57.3678 83.9744 57.502 84.1335 57.6644 84.3125C57.8268 84.4948 58.0489 84.6522 58.3306 84.7848C58.6156 84.9207 58.9885 84.9886 59.4492 84.9886C60.0657 84.9886 60.5745 84.8395 60.9755 84.5412C61.3765 84.2429 61.5771 83.7756 61.5771 83.1392V81.5881H61.4776C61.3915 81.7273 61.2688 81.8996 61.1097 82.1051C60.954 82.3073 60.7286 82.4879 60.4336 82.647C60.1419 82.8028 59.7475 82.8807 59.2504 82.8807C58.6339 82.8807 58.0804 82.7348 57.5898 82.4432C57.1026 82.1515 56.7165 81.7273 56.4315 81.1705C56.1497 80.6136 56.0089 79.9375 56.0089 79.142C56.0089 78.3598 56.1464 77.6787 56.4215 77.0987C56.6966 76.5154 57.0794 76.0646 57.57 75.7464C58.0605 75.425 58.6272 75.2642 59.2702 75.2642C59.7674 75.2642 60.1618 75.3471 60.4535 75.5128C60.7485 75.6752 60.9738 75.8608 61.1296 76.0696C61.2887 76.2751 61.4113 76.4441 61.4975 76.5767H61.6168V75.3636H62.7504V83.2188C62.7504 83.875 62.6012 84.4086 62.3029 84.8196C62.0079 85.2339 61.6102 85.5372 61.1097 85.7294C60.6126 85.925 60.0591 86.0227 59.4492 86.0227ZM59.4094 81.8267C59.8801 81.8267 60.2778 81.719 60.6026 81.5036C60.9274 81.2881 61.1744 80.9782 61.3434 80.5739C61.5124 80.1695 61.5969 79.6856 61.5969 79.1222C61.5969 78.572 61.5141 78.0864 61.3484 77.6655C61.1826 77.2446 60.9374 76.9148 60.6126 76.6761C60.2878 76.4375 59.8867 76.3182 59.4094 76.3182C58.9123 76.3182 58.498 76.4441 58.1665 76.696C57.8384 76.9479 57.5915 77.286 57.4258 77.7102C57.2634 78.1345 57.1822 78.6051 57.1822 79.1222C57.1822 79.6525 57.265 80.1214 57.4308 80.5291C57.5998 80.9335 57.8484 81.2517 58.1765 81.4837C58.5079 81.7124 58.9189 81.8267 59.4094 81.8267ZM64.8981 83V75.3636H66.0316V76.517H66.1112C66.2504 76.1392 66.5022 75.8326 66.8668 75.5973C67.2314 75.362 67.6424 75.2443 68.0998 75.2443C68.186 75.2443 68.2937 75.246 68.4229 75.2493C68.5522 75.2526 68.65 75.2576 68.7163 75.2642V76.4574C68.6765 76.4474 68.5853 76.4325 68.4428 76.4126C68.3036 76.3894 68.1561 76.3778 68.0004 76.3778C67.6291 76.3778 67.2977 76.4557 67.006 76.6115C66.7177 76.764 66.489 76.9761 66.32 77.2479C66.1542 77.5163 66.0714 77.8229 66.0714 78.1676V83H64.8981ZM72.3542 83.179C71.8703 83.179 71.4312 83.0878 71.0368 82.9055C70.6423 82.7199 70.3291 82.4531 70.0971 82.1051C69.8651 81.7538 69.7491 81.3295 69.7491 80.8324C69.7491 80.3949 69.8353 80.0402 70.0076 79.7685C70.18 79.4934 70.4103 79.2779 70.6987 79.1222C70.987 78.9664 71.3052 78.8504 71.6532 78.7741C72.0046 78.6946 72.3575 78.6316 72.7122 78.5852C73.1762 78.5256 73.5524 78.4808 73.8407 78.451C74.1324 78.4179 74.3445 78.3632 74.4771 78.2869C74.613 78.2107 74.6809 78.0781 74.6809 77.8892V77.8494C74.6809 77.3589 74.5467 76.9777 74.2782 76.706C74.0131 76.4342 73.6104 76.2983 73.0701 76.2983C72.51 76.2983 72.0708 76.4209 71.7527 76.6662C71.4345 76.9115 71.2108 77.1733 71.0815 77.4517L69.9679 77.054C70.1667 76.59 70.4319 76.2287 70.7633 75.9702C71.0981 75.7083 71.4627 75.526 71.8571 75.4233C72.2548 75.3172 72.6459 75.2642 73.0304 75.2642C73.2756 75.2642 73.5574 75.294 73.8755 75.3537C74.197 75.41 74.5069 75.5277 74.8052 75.7067C75.1068 75.8857 75.3571 76.1558 75.5559 76.517C75.7548 76.8783 75.8542 77.3622 75.8542 77.9688V83H74.6809V81.9659H74.6213C74.5417 82.1316 74.4092 82.3089 74.2235 82.4979C74.0379 82.6868 73.791 82.8475 73.4828 82.9801C73.1745 83.1127 72.7984 83.179 72.3542 83.179ZM72.5332 82.125C72.9972 82.125 73.3883 82.0339 73.7065 81.8516C74.028 81.6693 74.2699 81.4339 74.4324 81.1456C74.5981 80.8572 74.6809 80.554 74.6809 80.2358V79.1619C74.6312 79.2216 74.5218 79.2763 74.3528 79.326C74.1871 79.3724 73.9949 79.4138 73.7761 79.4503C73.5607 79.4834 73.3502 79.5133 73.1447 79.5398C72.9425 79.563 72.7785 79.5829 72.6525 79.5994C72.3476 79.6392 72.0626 79.7038 71.7974 79.7933C71.5356 79.8795 71.3234 80.0104 71.161 80.1861C71.002 80.3584 70.9224 80.5937 70.9224 80.892C70.9224 81.2997 71.0732 81.608 71.3748 81.8168C71.6797 82.0223 72.0659 82.125 72.5332 82.125ZM77.9957 83V75.3636H79.1293V76.5568H79.2287C79.3878 76.1491 79.6446 75.8326 79.9993 75.6072C80.3539 75.3786 80.7798 75.2642 81.277 75.2642C81.7808 75.2642 82.2 75.3786 82.5348 75.6072C82.8729 75.8326 83.1364 76.1491 83.3253 76.5568H83.4048C83.6004 76.1624 83.8937 75.8492 84.2848 75.6172C84.6759 75.3819 85.1449 75.2642 85.6918 75.2642C86.3745 75.2642 86.933 75.478 87.3672 75.9055C87.8014 76.3298 88.0185 76.991 88.0185 77.8892V83H86.8452V77.8892C86.8452 77.3258 86.6911 76.9231 86.3828 76.6811C86.0746 76.4392 85.7116 76.3182 85.294 76.3182C84.7571 76.3182 84.3411 76.4806 84.0462 76.8054C83.7512 77.1269 83.6037 77.5346 83.6037 78.0284V83H82.4105V77.7699C82.4105 77.3357 82.2696 76.986 81.9879 76.7209C81.7062 76.4524 81.3433 76.3182 80.8991 76.3182C80.5942 76.3182 80.3092 76.3994 80.044 76.5618C79.7822 76.7242 79.5701 76.9496 79.4077 77.2379C79.2486 77.523 79.169 77.8527 79.169 78.2273V83H77.9957Z"
        fill="white"
      />
      <path
        d="M302.938 27.6122C303.515 23.8725 299.972 20.9208 296.66 22.3807L230.687 51.4582C228.312 52.5051 228.486 56.1169 230.949 56.9045L244.555 61.2538C247.151 62.0839 249.963 61.6547 252.23 60.0822L282.904 38.8084C283.829 38.1669 284.837 39.4871 284.047 40.3051L261.968 63.1573C259.826 65.3741 260.251 69.1304 262.827 70.7522L287.548 86.3142C290.32 88.0596 293.887 86.3062 294.406 82.9428L302.938 27.6122Z"
        fill="white"
      />
      <defs>
        <linearGradient
          id="paint0_linear_993_10677"
          x1="328"
          y1="108"
          x2="328"
          y2="0"
          gradientUnits="userSpaceOnUse"
        >
          <stop stopColor="#00C6FB" />
          <stop offset="1" stopColor="#005BEA" />
        </linearGradient>
      </defs>
    </svg>
  );
};


const UserAvatar = ({userData}: {userData?: User}) => {
  const { data: clientDetail } = useClientDetail(userData?.unique_url_id || "");

  return <AvatarLabelGroup
        size="sm"
        src={WebApp.initDataUnsafe.user?.photo_url}
        alt={userData?.role_in_business || ""}
        title={formatFullname(userData?.fullname)}
        subtitle={(userData?.role_in_business || "") + (clientDetail?.table ? `. Номер стола: ${clientDetail?.table}` : ". Номер стола: N/A")}
      />
}